markluo0311/nrf52832_bt_mesh/mesh/models/config/src/config_client.c
static bool get_opcode_index(config_opcode_t opcode, uint32_t * p_index)
{
    /* TODO: ~ Optimization candidate ~ */
    for (uint32_t i = 0; i < sizeof(m_config_message_lut)/sizeof(m_config_message_lut[0]); ++i)
    {
        if (m_config_message_lut[i].opcode == opcode)
        {
            *p_index = i;
            return true;
        }
    }
    return false;
}

static void config_opcode_handler(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    uint32_t i = 0;
    NRF_MESH_ASSERT(get_opcode_index((config_opcode_t) p_message->opcode.opcode, &i));
    if (p_message->length < m_config_message_lut[i].payload_length_min ||
        p_message->length > m_config_message_lut[i].payload_length_max)
    {
        return;
    }

    config_client_event_t evt = {(config_opcode_t) p_message->opcode.opcode, (const config_msg_t *) p_message->p_data};
    m_client.event_cb(CONFIG_CLIENT_EVENT_TYPE_MSG, &evt, p_message->length);
}

static bool client_in_wrong_state(uint32_t * p_status)
{
    if (m_client.state == CONFIG_CLIENT_STATE_NONE)
    {
        *p_status = NRF_ERROR_INVALID_STATE;
        return true;
    }
    else if (m_client.state == CONFIG_CLIENT_STATE_WAIT_REPLY)
    {
        *p_status = NRF_ERROR_BUSY;
        return true;
    }
    return false;
}

static uint32_t subscription_virtual_add_del_owr_send(uint16_t element_address,
                                                      nrf_mesh_address_t address,
                                                      access_model_id_t model_id,
                                                      config_opcode_t opcode)
{
    NRF_MESH_ASSERT(mp_packet_buffer == NULL);
    bool sig_model = IS_SIG_MODEL(model_id);
    uint16_t length = PACKET_LENGTH_WITH_ID(config_msg_subscription_virtual_add_del_owr_t, sig_model);
    uint32_t status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_subscription_virtual_add_del_owr_t * p_msg = (config_msg_subscription_virtual_add_del_owr_t *) mp_packet_buffer;
    p_msg->element_address = element_address;
    memcpy(p_msg->virtual_uuid, address.p_virtual_uuid, NRF_MESH_UUID_SIZE);
    p_msg->model_id.model_id = model_id.model_id;
    p_msg->model_id.company_id = model_id.company_id;

    return send_reliable(opcode, length, CONFIG_OPCODE_MODEL_SUBSCRIPTION_STATUS);
}

static uint32_t subscription_add_del_owr_send(uint16_t element_address, nrf_mesh_address_t address, access_model_id_t model_id, config_opcode_t opcode)
{

    NRF_MESH_ASSERT(mp_packet_buffer == NULL);
    bool sig_model = IS_SIG_MODEL(model_id);
    uint16_t length = PACKET_LENGTH_WITH_ID(config_msg_subscription_add_del_owr_t, sig_model);
    uint32_t status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_subscription_add_del_owr_t * p_msg = (config_msg_subscription_add_del_owr_t *) mp_packet_buffer;
    p_msg->element_address = element_address;
    p_msg->address = address.value;
    p_msg->model_id.model_id = model_id.model_id;
    p_msg->model_id.company_id = model_id.company_id;

    return send_reliable(opcode, length, CONFIG_OPCODE_MODEL_SUBSCRIPTION_STATUS);
}


static uint32_t publication_set(const config_publication_state_t * p_publication_state)
{
    NRF_MESH_ASSERT(mp_packet_buffer == NULL);
    bool sig_model = IS_SIG_MODEL(p_publication_state->model_id);
    uint16_t length = PACKET_LENGTH_WITH_ID(config_msg_publication_set_t, sig_model);
    uint32_t status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_publication_set_t * p_msg = (config_msg_publication_set_t *) mp_packet_buffer;
    p_msg->element_address = p_publication_state->element_address;
    p_msg->publish_address = p_publication_state->publish_address.value;
    p_msg->state.appkey_index = p_publication_state->appkey_index;
    p_msg->state.credential_flag = 0; /* TODO: Not supported. */
    p_msg->state.rfu = 0;
    p_msg->state.publish_ttl = p_publication_state->publish_ttl;
    p_msg->state.publish_period = p_publication_state->publish_period;
    p_msg->state.retransmit_count = p_publication_state->retransmit_count;
    p_msg->state.retransmit_interval = p_publication_state->retransmit_interval;
    p_msg->state.model_id.model_id = p_publication_state->model_id.model_id;
    p_msg->state.model_id.company_id = p_publication_state->model_id.company_id;

    return send_reliable(CONFIG_OPCODE_MODEL_PUBLICATION_SET, length, CONFIG_OPCODE_MODEL_PUBLICATION_STATUS);
}

static uint32_t publication_virtual_set(const config_publication_state_t * p_publication_state)
{
    NRF_MESH_ASSERT(mp_packet_buffer == NULL);
    bool sig_model = IS_SIG_MODEL(p_publication_state->model_id);
    uint16_t length = PACKET_LENGTH_WITH_ID(config_msg_publication_virtual_set_t, sig_model);
    uint32_t status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_publication_virtual_set_t * p_msg = (config_msg_publication_virtual_set_t *) mp_packet_buffer;
    p_msg->element_address = p_publication_state->element_address;
    memcpy(p_msg->publish_uuid, p_publication_state->publish_address.p_virtual_uuid, NRF_MESH_UUID_SIZE);
    p_msg->state.appkey_index = p_publication_state->appkey_index;
    p_msg->state.credential_flag = 0; /* TODO: Not supported. */
    p_msg->state.rfu = 0;
    p_msg->state.publish_ttl = p_publication_state->publish_ttl;
    p_msg->state.publish_period = p_publication_state->publish_period;
    p_msg->state.retransmit_count = p_publication_state->retransmit_count;
    p_msg->state.retransmit_interval = p_publication_state->retransmit_interval;
    p_msg->state.model_id.model_id = p_publication_state->model_id.model_id;
    p_msg->state.model_id.company_id = p_publication_state->model_id.company_id;

    return send_reliable(CONFIG_OPCODE_MODEL_PUBLICATION_VIRTUAL_ADDRESS_SET, length, CONFIG_OPCODE_MODEL_PUBLICATION_STATUS);
}

static uint32_t app_bind_unbind_send(uint16_t element_address, uint16_t appkey_index, access_model_id_t model_id, config_opcode_t opcode)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    NRF_MESH_ASSERT(mp_packet_buffer == NULL);
    bool sig_model = IS_SIG_MODEL(model_id);
    uint16_t length = PACKET_LENGTH_WITH_ID(config_msg_app_bind_unbind_t, sig_model);
    status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_app_bind_unbind_t * p_msg = (config_msg_app_bind_unbind_t *) mp_packet_buffer;
    p_msg->element_address = element_address;
    p_msg->appkey_index = appkey_index;
    p_msg->model_id.model_id = model_id.model_id;
    p_msg->model_id.company_id = model_id.company_id;

    return send_reliable(opcode, length, CONFIG_OPCODE_MODEL_APP_STATUS);
}

/*****************************************************************************
 * Public API
 *****************************************************************************/

uint32_t config_client_init(config_client_event_cb_t event_cb)
{
    if (event_cb == NULL)
    {
        return NRF_ERROR_NULL;
    }

    const access_model_add_params_t alloc_params =
        {
            .model_id = {
                .model_id = CONFIG_CLIENT_MODEL_ID,
                .company_id = ACCESS_COMPANY_ID_NONE
            },
            .element_index = 0,
            .p_opcode_handlers = m_opcode_handlers,
            .opcode_count = sizeof(m_opcode_handlers) / sizeof(m_opcode_handlers[0])
        };

    /* Ensure that the model has not already been initialized. */
    NRF_MESH_ASSERT(m_client.state == CONFIG_CLIENT_STATE_NONE);

    uint32_t status = access_model_add(&alloc_params, &m_client.model_handle);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    m_client.state = CONFIG_CLIENT_STATE_IDLE;
    m_client.event_cb = event_cb;
    return NRF_SUCCESS;
}

uint32_t config_client_server_set(dsm_handle_t server_devkey_handle, dsm_handle_t server_address_handle)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }
    else if (server_address_handle == DSM_HANDLE_INVALID)
    {
        return NRF_ERROR_INVALID_ADDR;
    }
    else if (server_devkey_handle == DSM_HANDLE_INVALID)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    NRF_MESH_ASSERT(m_client.model_handle != ACCESS_HANDLE_INVALID);
    dsm_handle_t old_address = DSM_HANDLE_INVALID;
    status = access_model_publish_address_get(m_client.model_handle, &old_address);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    status = access_model_publish_address_set(m_client.model_handle, server_address_handle);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    status = access_model_publish_application_set(m_client.model_handle, server_devkey_handle);
    if (status != NRF_SUCCESS)
    {
        if (old_address != DSM_HANDLE_INVALID)
        {
            /* Attempt to recover. */
            (void) access_model_publish_address_set(m_client.model_handle, old_address);
        }
        return status;
    }
    else
    {
        access_flash_config_store();
        return status;
    }

