markluo0311/nrf52832_bt_mesh/mesh/models/config/src/config_client.c
    config_msg_default_ttl_t * p_msg = (config_msg_default_ttl_t *) mp_packet_buffer;
    p_msg->ttl = ttl;

    return send_reliable(CONFIG_OPCODE_DEFAULT_TTL_SET, length, CONFIG_OPCODE_DEFAULT_TTL_STATUS);
}

uint32_t config_client_model_subscription_add(uint16_t element_address, nrf_mesh_address_t address, access_model_id_t model_id)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }
    else if (address.type == NRF_MESH_ADDRESS_TYPE_VIRTUAL)
    {
        return subscription_virtual_add_del_owr_send(element_address, address, model_id, CONFIG_OPCODE_MODEL_SUBSCRIPTION_VIRTUAL_ADDRESS_ADD);
    }
    else
    {
        return subscription_add_del_owr_send(element_address, address, model_id, CONFIG_OPCODE_MODEL_SUBSCRIPTION_ADD);
    }
}

uint32_t config_client_model_subscription_delete(uint16_t element_address, nrf_mesh_address_t address, access_model_id_t model_id)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }
    else if (address.type == NRF_MESH_ADDRESS_TYPE_VIRTUAL)
    {
        return subscription_virtual_add_del_owr_send(element_address, address, model_id, CONFIG_OPCODE_MODEL_SUBSCRIPTION_VIRTUAL_ADDRESS_DELETE);
    }
    else
    {
        return subscription_add_del_owr_send(element_address, address, model_id, CONFIG_OPCODE_MODEL_SUBSCRIPTION_DELETE);
    }
}

uint32_t config_client_model_subscription_delete_all(uint16_t element_address, access_model_id_t model_id)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    NRF_MESH_ASSERT(mp_packet_buffer == NULL);
    bool sig_model = IS_SIG_MODEL(model_id);
    uint16_t length = PACKET_LENGTH_WITH_ID(config_msg_subscription_delete_all_t, sig_model);
    status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_subscription_delete_all_t * p_msg = (config_msg_subscription_delete_all_t *) mp_packet_buffer;
    p_msg->element_address = element_address;
    p_msg->model_id.model_id = model_id.model_id;
    p_msg->model_id.company_id = model_id.company_id;

    return send_reliable(CONFIG_OPCODE_MODEL_SUBSCRIPTION_DELETE_ALL, length, CONFIG_OPCODE_MODEL_SUBSCRIPTION_STATUS);
}

uint32_t config_client_model_subscription_get(uint16_t element_address, access_model_id_t model_id)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    NRF_MESH_ASSERT(mp_packet_buffer == NULL);
    bool sig_model = IS_SIG_MODEL(model_id);
    uint16_t length = PACKET_LENGTH_WITH_ID(config_msg_model_subscription_get_t, sig_model);
    status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_model_subscription_get_t * p_msg = (config_msg_model_subscription_get_t *) mp_packet_buffer;
    p_msg->element_address = element_address;
    p_msg->model_id.model_id = model_id.model_id;
    p_msg->model_id.company_id = model_id.company_id;

    config_opcode_t opcode = sig_model ? CONFIG_OPCODE_SIG_MODEL_SUBSCRIPTION_GET : CONFIG_OPCODE_VENDOR_MODEL_SUBSCRIPTION_GET;
    return send_reliable(opcode, length, CONFIG_OPCODE_MODEL_SUBSCRIPTION_STATUS);
}

uint32_t config_client_model_subscription_overwrite(uint16_t element_address, nrf_mesh_address_t address, access_model_id_t model_id)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }
    else if (address.type == NRF_MESH_ADDRESS_TYPE_VIRTUAL)
    {
        return subscription_virtual_add_del_owr_send(element_address, address, model_id, CONFIG_OPCODE_MODEL_SUBSCRIPTION_VIRTUAL_ADDRESS_OVERWRITE);
    }
    else
    {
        return subscription_add_del_owr_send(element_address, address, model_id, CONFIG_OPCODE_MODEL_SUBSCRIPTION_OVERWRITE);
    }
}

uint32_t config_client_relay_get(void)
{
    return send_reliable(CONFIG_OPCODE_RELAY_GET, 0, CONFIG_OPCODE_RELAY_STATUS);
}

uint32_t config_client_relay_set(config_relay_state_t relay_state, uint8_t retransmit_count, uint8_t retransmit_interval_steps)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }
    else if (retransmit_count > CONFIG_RETRANSMIT_COUNT_MAX ||
        retransmit_interval_steps > CONFIG_RETRANSMIT_INTERVAL_STEPS_MAX)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    NRF_MESH_ASSERT(mp_packet_buffer == NULL);

    uint16_t length = sizeof(config_msg_relay_set_t);
    status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_relay_set_t * p_msg = (config_msg_relay_set_t *) mp_packet_buffer;
    p_msg->relay_state = relay_state;
    p_msg->relay_retransmit_count = retransmit_count;
    p_msg->relay_retransmit_interval_steps = retransmit_interval_steps;

    return send_reliable(CONFIG_OPCODE_RELAY_SET, length, CONFIG_OPCODE_RELAY_STATUS);
}

uint32_t config_client_model_app_bind(uint16_t element_address, uint16_t appkey_index, access_model_id_t model_id)
{
    return app_bind_unbind_send(element_address, appkey_index, model_id, CONFIG_OPCODE_MODEL_APP_BIND);
}

uint32_t config_client_model_app_get(uint16_t element_address, access_model_id_t model_id)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    NRF_MESH_ASSERT(mp_packet_buffer == NULL);
    bool sig_model = IS_SIG_MODEL(model_id);
    uint16_t length = PACKET_LENGTH_WITH_ID(config_msg_model_app_get_t, sig_model);
    status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_model_app_get_t * p_msg = (config_msg_model_app_get_t *) mp_packet_buffer;
    p_msg->element_address = element_address;
    p_msg->model_id.model_id = model_id.model_id;
    p_msg->model_id.company_id = model_id.company_id;

    config_opcode_t opcode = sig_model ? CONFIG_OPCODE_SIG_MODEL_APP_GET : CONFIG_OPCODE_VENDOR_MODEL_APP_GET;
    return send_reliable(opcode, length, CONFIG_OPCODE_MODEL_APP_STATUS);
}


uint32_t config_client_model_app_unbind(uint16_t element_address, uint16_t appkey_index, access_model_id_t model_id)
{
    return app_bind_unbind_send(element_address, appkey_index, model_id, CONFIG_OPCODE_MODEL_APP_UNBIND);
}

uint32_t config_client_netkey_add(uint16_t netkey_index, const uint8_t * p_netkey)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    NRF_MESH_ASSERT(mp_packet_buffer == NULL);
    uint16_t length = sizeof(config_msg_netkey_add_update_t);
    status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_netkey_add_update_t * p_msg = (config_msg_netkey_add_update_t *) mp_packet_buffer;
    p_msg->netkey_index = netkey_index & CONFIG_MSG_KEY_INDEX_12_MASK;
    memcpy(p_msg->netkey, p_netkey, NRF_MESH_KEY_SIZE);

    return send_reliable(CONFIG_OPCODE_NETKEY_ADD, length, CONFIG_OPCODE_NETKEY_STATUS);
}

uint32_t config_client_netkey_delete(uint16_t netkey_index)
{
    uint32_t status = NRF_SUCCESS;
    if (client_in_wrong_state(&status))
    {
        return status;
    }

    NRF_MESH_ASSERT(mp_packet_buffer == NULL);
    uint16_t length = sizeof(config_msg_netkey_delete_t);
    status = packet_mgr_alloc((packet_generic_t **) &mp_packet_buffer, length);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    config_msg_netkey_delete_t * p_msg = (config_msg_netkey_delete_t *) mp_packet_buffer;
    p_msg->netkey_index = netkey_index & CONFIG_MSG_KEY_INDEX_12_MASK;

